EmilZander/Bushaltestelle-ESP8266/Firmware/src/main.cpp
      <div class="preview" aria-hidden="true">
        <div id="pv1" class="row">&nbsp;</div>
        <div id="pv2" class="row">&nbsp;</div>
      </div>
    </form>
  </main>

  <script>
    const row1 = document.getElementById('row1');
    const row2 = document.getElementById('row2');
    const count1 = document.getElementById('count1');
    const count2 = document.getElementById('count2');
    const pv1 = document.getElementById('pv1');
    const pv2 = document.getElementById('pv2');
    const form = document.getElementById('busForm');

    function sanitizeText(text){
      const replacements = { 'ä':'a','ö':'o','ü':'u','Ä':'A','Ö':'O','Ü':'U','ß':'ss' };
      let clean = text.replace(/[\n\r]/g, '');
      clean = clean.replace(/[äöüÄÖÜß]/g, m => replacements[m] || '');
      return clean;
    }

    function updatePreview(inputEl, previewEl, countEl){
      inputEl.value = sanitizeText(inputEl.value);
      if(inputEl.value.length > 16) inputEl.value = inputEl.value.slice(0,16);
      countEl.textContent = `${inputEl.value.length}/16`;
      previewEl.textContent = inputEl.value || '\u00A0';
    }

    function clearField(n){
      const field = document.getElementById('row' + n);
      const preview = document.getElementById('pv' + n);
      const count = document.getElementById('count' + n);
      field.value = '';
      updatePreview(field, preview, count);
      field.focus();
    }

    row1.addEventListener('input', ()=> updatePreview(row1,pv1,count1));
    row2.addEventListener('input', ()=> updatePreview(row2,pv2,count2));

    updatePreview(row1,pv1,count1);
    updatePreview(row2,pv2,count2);

    form.addEventListener('submit', ()=>{
      row1.value = encodeURIComponent(sanitizeText(row1.value.slice(0,16)));
      row2.value = encodeURIComponent(sanitizeText(row2.value.slice(0,16)));
    });
  </script>
</body>
</html>
)rawliteral";
#pragma endregion

#pragma region Preferences
const char* html_prefs = R"rawliteral(
<!doctype html>
<html lang="de">
<head>
  <meta charset="utf-8" />
  <meta name="viewport" content="width=device-width, initial-scale=1" />
  <title>Preferences — Bushaltestelle</title>
  <style>
    @import url('https://fonts.googleapis.com/css2?family=Press+Start+2P&display=swap');

    :root{
      --lcd-bg:#000000;
      --lcd-text:#FF8C00;
      --bg:#F0F0F0;
      --card:#FFFFFF;
      --accent:#FFEB3B;
      --muted:#4CAF50;
    }

    html,body{height:100%;}
    body{
      margin:0;
      font-family:system-ui,-apple-system,Segoe UI,Roboto,Helvetica,Arial;
      background:var(--bg);
      color:#333;
      display:flex;
      flex-direction:column;
      align-items:center;
      justify-content:flex-start;
      padding:20px;
      gap:20px;
      position:relative;
    }

    h1,h2{
      font-size:clamp(18px,3vw,24px);
      color:var(--muted);
      margin:0 0 6px 0;
      text-align:center;
    }

    .back-button {
      position:absolute;
      top:20px;
      left:20px;
      width:50px;
      height:50px;
      border-radius:50%;
      border:3px solid #4CAF50;
      background-color:#FFEB3B;
      display:flex;
      align-items:center;
      justify-content:center;
      cursor:pointer;
      padding:0;
    }

    .card{
      width:100%;
      max-width:540px;
      background:var(--card);
      border-radius:14px;
      padding:20px;
      box-shadow:0 4px 20px rgba(0,0,0,0.2);
      display:flex;
      flex-direction:column;
      gap:12px;
      position:relative;
    }

    label{font-size:13px;color:var(--muted);display:block}
    .field{display:flex;flex-direction:column;gap:6px;position:relative;}

    input[type="text"], input[type="password"]{
      padding:12px 40px 12px 14px;
      font-size:16px;
      border-radius:8px;
      border:1px solid #CCCCCC;
      background:#F9F9F9;
      color:#333;
      outline:none;
      box-sizing:border-box;
      font-family:monospace;
    }

    .controls{display:flex;gap:10px;flex-wrap:wrap;justify-content:center;margin-top:6px}
    .controls button{
      appearance:none;border:0;padding:12px 18px;border-radius:10px;font-size:16px;cursor:pointer;background:var(--accent);color:#000;font-weight:600;min-width:120px;
    }

    .note{font-size:13px;color:#666;margin-top:6px}

    /* Toggle Switch */
    .toggle-switch {
      position: relative;
      display: inline-block;
      width: 50px;
      height: 28px;
    }
    .toggle-switch input {
      opacity: 0;
      width: 0;
      height: 0;
    }
    .slider {
      position: absolute;
      cursor: pointer;
      top: 0;
      left: 0;
      right: 0;
      bottom: 0;
      background-color: #ccc;
      border-radius: 28px;
      transition: 0.4s;
    }
    .slider:before {
      position: absolute;
      content: "";
      height: 20px;
      width: 20px;
      left: 4px;
      bottom: 4px;
      background-color: white;
      border-radius: 50%;
      transition: 0.4s;
    }
    input:checked + .slider {
      background-color: var(--muted);
    }
    input:checked + .slider:before {
      transform: translateX(22px);
    }

    /* API Client Cards */
    .api-client-card {
      display:flex;
      align-items:center;
      justify-content:space-between;
      background:#fff;
      border:1px solid #ddd;
      border-radius:10px;
      padding:12px 16px;
      box-shadow:0 2px 8px rgba(0,0,0,0.1);
    }

    .api-client-name {
      font-weight:600;
      color:#333;
    }

    .api-client-actions {
      display:flex;
      align-items:center;
      gap:10px;
    }

    /* Info & Add Buttons */
    .info-btn, .add-btn {
      width:40px;
      height:40px;
      border-radius:50%;
      border:3px solid var(--muted);
      background-color:var(--accent);
      display:flex;
      align-items:center;
      justify-content:center;
      cursor:pointer;
      font-weight:bold;
      color:var(--muted);
      font-family:'Press Start 2P', cursive;
      font-size:18px;
      line-height:0;
    }

    .add-btn {
      position:absolute;
      bottom:16px;
      right:16px;
      box-shadow:0 4px 10px rgba(0,0,0,0.3);
      z-index:5;
    }

  </style>
</head>
<body>

