EmilZander/Bushaltestelle-ESP8266/Firmware/src/main.cpp
    <div class="dot-container">
      <div class="dot"></div><div class="dot"></div><div class="dot"></div>
    </div>

    <div class="message-box">%MESSAGE%</div>
  </div>

  <script>
    window.showBusLoader = ()=> document.querySelector('.loader-screen').style.display='flex';
    window.hideBusLoader = ()=> document.querySelector('.loader-screen').style.display='none';
  </script>
</body>
</html>
)rawliteral";
#pragma endregion
#pragma endregion

#pragma region Variables

#pragma region Globals
LiquidCrystal_I2C lcd(0x27, 16, 2); // The LCD-display
ESP8266WebServer server(80); // The webserver to be hosted
#pragma endregion

static const uint16_t WIFI_MAGIC = 0xA5A5;
static const uint16_t API_MAGIC = 0xB5B5;
static const int EEPROM_SIZE_BYTES = 2048;  // Vergrößert für API-Clients
static const int EEPROM_WIFI_ADDR = 0;
static const int EEPROM_API_ADDR = 256;     // API-Clients Start nach WiFi-Daten

// EEPROM-backed storage for WiFi credentials
struct WifiCreds {
  uint16_t magic;
  char ssid[33];      // 32 chars + null
  char password[65];  // 64 chars + null
};

struct APIclient
{
  int id;
  char name[33];      // 32 chars + null
  char apiKey[17];  // 16 chars + null
  bool enabled;      // 0 = disabled, 1 = enabled
};

const APIclient EMPTY_CLIENT = { -1, "", "", false };

class APIclientList
{
  private:
    static const int MAX_CLIENTS = 16;
    static APIclient clients[MAX_CLIENTS];
    static int clientCount;
  public:
    static const APIclient* clients_get()
    {
      return clients;
    }

    static int clientCount_get()
    {
      for (int i = 0; i < MAX_CLIENTS; i++)
      {
        if (clients[i].id == -1)
        {
          clientCount = i;
          break;
        }
      }

      return clientCount;
    }

    static APIclient clients_getByID(int id)
    {
      if (id == -1)
      {
        return EMPTY_CLIENT;
      }

      for (int i = 0; i < clientCount; i++)
      {
        if (clients[i].id == id)
        {
          return clients[i];
        }
      }
      return EMPTY_CLIENT;
    }

    static bool clients_add(const APIclient& client)
    {
      if (clientCount >= MAX_CLIENTS)
      {
        return false; // List full
      }

      clients[clientCount] = client;
      clientCount++;
      return true;
    }
    
    static bool clients_add(const char* name, const char* apiKey)
    {
      APIclient client;
      client.id = clientCount;
      strncpy(client.name, name, sizeof(client.name)-1);
      strncpy(client.apiKey, apiKey, sizeof(client.apiKey)-1);
      return clients_add(client);
    }

    static void clients_clear()
    {
      clientCount = 0;
      memset(clients, 0, sizeof(clients));
    }

    static void clients_removeByID(int id)
    {
      for (int i = 0; i < clientCount; i++)
      {
        if (clients[i].id == id)
        {
          // Shift remaining clients down
          for (int j = i; j < clientCount - 1; j++)
          {
            clients[j] = clients[j + 1];
          }
          clientCount--;
          break;
        }
      }
    }

    static void clients_setByID(int id, const char* name, const char* apiKey)
    {
      for (int i = 0; i < clientCount; i++)
      {
        if (clients[i].id == id)
        {
          strncpy(clients[i].name, name, sizeof(clients[i].name)-1);
          strncpy(clients[i].apiKey, apiKey, sizeof(clients[i].apiKey)-1);
          break;
        }
      }
    }

    // Speichert die API-Clients im EEPROM
    bool saveToEEPROM() {
      struct APIClientHeader {
        uint16_t magic;
        uint8_t count;
      } header;

      header.magic = API_MAGIC;
      header.count = clientCount;

      EEPROM.begin(EEPROM_SIZE_BYTES);
      
      // Header schreiben
      EEPROM.put(EEPROM_API_ADDR, header);
      
      // Clients schreiben
      int offset = EEPROM_API_ADDR + sizeof(header);
      for (int i = 0; i < clientCount; i++) {
        EEPROM.put(offset, clients[i]);
        offset += sizeof(APIclient);
      }

      bool success = EEPROM.commit();
      EEPROM.end();
      return success;
    }

    // Lädt die API-Clients aus dem EEPROM
    bool fetchFromEEPROM() {
      struct APIClientHeader {
        uint16_t magic;
        uint8_t count;
      } header;

      EEPROM.begin(EEPROM_SIZE_BYTES);
      
      // Header lesen
      EEPROM.get(EEPROM_API_ADDR, header);

      // Prüfen ob valide Daten
      if (header.magic != API_MAGIC || header.count > MAX_CLIENTS) {
        // Keine oder ungültige Daten -> Liste leeren
        clients_clear();
        EEPROM.end();
        return false;
      }

      // Clients lesen
      clientCount = header.count;
      int offset = EEPROM_API_ADDR + sizeof(header);
      for (int i = 0; i < clientCount; i++) {
        EEPROM.get(offset, clients[i]);
        offset += sizeof(APIclient);
      }

      EEPROM.end();
      return true;
    }
};

// WiFi login data
String ssid;
String password;

bool stopButtonVal = false; // The value of the stop button

bool apiActivated = false; // If the api requests go through (persisted in EEPROM)

// The text shown by the LCD
String line1Text = "";
String line2Text = "";

// The text shown by the LCD before the temp text was displayed
String line1prevText = "";
String line2prevText = "";

// Until this timestamp the temporary text is displayed
unsigned long displayTempTextUntil = 0;
#pragma endregion

#pragma region Method Declaration
void displayText(String line1, String line2);
void displayTextTemp(const String& line1, const String& line2, const int time);
void clearDisplay(int row);
void fetchPrefs();
void putPrefs();
void handleStopButton();
void handleDisplay();
void showLoadingScreen(int statusCode, const String& message);
void handleRoot();
void handlePreferences();
void handleClear();
void handleApiClear();
void handleApiSet();
void handleApiGet();
void handlePrefsApply();
void handlePrefsApi();
void handleSet();
void webServerRoutes();
#pragma endregion

#pragma region Hilfsfunktionen
//=======AUXILIARY FUNCTIONS========//

