EmilZander/Bushaltestelle-ESP8266/Firmware/src/main.cpp
// Display text on the LCD
void displayText(String line1 = "", String line2 = "") {
  if (line1 != "")
    line1Text = line1;

  if (line2 != "")
    line2Text = line2;

  lcd.clear();
  lcd.setCursor(0, 0);
  lcd.print(line1Text.c_str());
  lcd.setCursor(0, 1);
  lcd.print(line2Text.c_str());
}

// Display text for a set amount of time on the LCD. After the time has expired the current text is displayed again
void displayTextTemp(const String& line1, const String& line2, const int time) {
  line1prevText = line1Text;
  line2prevText = line2Text;
  displayTempTextUntil = millis() + time;
  displayText(line1, line2);
}

void clearDisplay(int row = -1)
{
  switch (row)
  {
  case -1:
    line1Text = "";
    line2Text = "";
    break;
  case 1:
    line1Text = "";
    break;
  case 2:
    line2Text = "";
    break;
  default:
    line1Text = "";
    line2Text = "";
    break;
  }
  displayText();
}

void fetchPrefs()
{
  EEPROM.begin(EEPROM_SIZE_BYTES);
  WifiCreds creds;
  // Read raw struct from EEPROM
  EEPROM.get(EEPROM_WIFI_ADDR, creds);

  if (creds.magic == WIFI_MAGIC) {
    // Valid data present
    creds.ssid[sizeof(creds.ssid)-1] = '\0';
    creds.password[sizeof(creds.password)-1] = '\0';
    ssid = String(creds.ssid);
    password = String(creds.password);
  } else {
    // No valid data -> use empty strings
    ssid = "";
    password = "";
    // Initialize EEPROM with an empty, valid record to avoid repeated reads
    memset(&creds, 0, sizeof(creds));
    creds.magic = WIFI_MAGIC;
    EEPROM.put(EEPROM_WIFI_ADDR, creds);
    EEPROM.commit();
  }

  EEPROM.end();
}

void putPrefs()
{
  EEPROM.begin(EEPROM_SIZE_BYTES);
  WifiCreds creds;
  memset(&creds, 0, sizeof(creds));
  creds.magic = WIFI_MAGIC;
  // Copy strings with boundary checks
  strncpy(creds.ssid, ssid.c_str(), sizeof(creds.ssid)-1);
  strncpy(creds.password, password.c_str(), sizeof(creds.password)-1);

  EEPROM.put(EEPROM_WIFI_ADDR, creds);
  EEPROM.commit();
  EEPROM.end();
}
#pragma endregion

#pragma region Handlers
//========HANDLERS========//

// Handle the stop button and how he behaves
void handleStopButton() {
    if (digitalRead(STOP_BUTTON) != stopButtonVal) {
        stopButtonVal = digitalRead(STOP_BUTTON);
        if (stopButtonVal == HIGH) {
          digitalWrite(LED, LOW);
          displayTextTemp("WAGEN HAELT", "WAGEN HAELT", 5000);
        }
        else {
          digitalWrite(LED, HIGH);
        }
    }
}

// Handle the display and make sure that the temporary text is refreshed
void handleDisplay() {
  if (displayTempTextUntil != (unsigned long)0 && millis() >= displayTempTextUntil) {
    displayTempTextUntil = 0;
    displayText(line1prevText, line2prevText);
  }
}
#pragma endregion

#pragma region WebServer
//=======WEBSERVER=======//

// Show the loading screen with a custom message
void showLoadingScreen(int statusCode, const String& message) {
  String html = String(html_loader);
  html.replace("%MESSAGE%", message);
  server.send(statusCode, "text/html", html);
}

// The logic for the root path ("/")
void handleRoot() {
  server.send(200, "text/html", html_main);
}

// The logic for the preferences path ("/preferences")
void handlePreferences() {

  String html = String(html_prefs);

  String apiList;
  for (int i = 0; i < APIclientList::clientCount_get(); i++)
  {
    APIclient client = APIclientList::clients_get()[i];
    
    apiList += String("<div class='api-client-card' data-id='") + client.id + "'>";
    apiList += "<div class='api-client-name'>" + (String) client.name + "</div>";
    apiList += "<div class='api-client-actions'>";
    apiList += "<label class='toggle-switch'><input type='checkbox'";
    if (client.enabled) apiList += " checked";
    apiList += "><span class='slider'></span></label>";
    apiList += "<button class='info-btn'>i</button>";
    apiList += "</div></div>";
  }
  html.replace("%API_LIST%", apiList);

  server.send(200, "text/html", html);
}

// The logic for the clear path ("/clear[?row=-1|1|2]")
void handleClear()
{
  int row = -1;
  if (server.hasArg("row")) row = server.arg("row").toInt();
  clearDisplay(row);

  server.sendHeader("Location", "/"); // Redirect to root
  showLoadingScreen(303, "Lösche Anzeige"); 
}

// The logic for the clear path ("/api/clear[?row=-1|1|2]")
void handleApiClear()
{
  if (!server.hasArg("id")) return;
  if (!server.hasArg("apiKey")) return;

  const APIclient client = APIclientList::clients_getByID(server.arg("id").toInt());

  if (client.id == -1)
  {
    // The json response
    StaticJsonDocument<200> response;
    response["status"] = "failed";
    response["message"] = "invalid client id";
    String jsonString;
    serializeJson(response, jsonString);

    server.send(200, "application/json", jsonString);
    return;
  }

  if ((String)client.apiKey != server.arg("apiKey"))
  {
    // The json response
    StaticJsonDocument<200> response;
    response["status"] = "failed";
    response["message"] = "invalid api key";
    String jsonString;
    serializeJson(response, jsonString);

    server.send(200, "application/json", jsonString);
    return;
  }

  if (!client.enabled)
  {
    // The json response
    StaticJsonDocument<200> response;
    response["status"] = "failed";
    response["message"] = "client disabled";
    String jsonString;
    serializeJson(response, jsonString);

    server.send(200, "application/json", jsonString);
    return;
  }

  int row = -1;
  if (server.hasArg("row")) row = server.arg("row").toInt();
  clearDisplay(row);

  // The json response
  StaticJsonDocument<200> response;
  response["status"] = "success";
  response["message"] = "";
  String jsonString;
  serializeJson(response, jsonString);

  server.send(200, "application/json", jsonString);
}

// The logic for the api-set-request ("/api/set?row1=[...]&row2=[...]")
void handleAPISet()
{
  if (!server.hasArg("id")) return;
  if (!server.hasArg("apiKey")) return;
  
  APIclient client = APIclientList::clients_getByID(server.arg("id").toInt());

