EmilZander/Bushaltestelle-ESP8266/Firmware/src/main.cpp
  if (client.id == -1)
  {
    // The json response
    StaticJsonDocument<200> response;
    response["status"] = "failed";
    response["message"] = "invalid client id";
    String jsonString;
    serializeJson(response, jsonString);

    server.send(200, "application/json", jsonString);
    return;
  }

  if ((String)client.apiKey != server.arg("apiKey"))
  {
    // The json response
    StaticJsonDocument<200> response;
    response["status"] = "failed";
    response["message"] = "invalid api key";
    String jsonString;
    serializeJson(response, jsonString);

    server.send(200, "application/json", jsonString);
    return;
  }

  if (!client.enabled)
  {
    // The json response
    StaticJsonDocument<200> response;
    response["status"] = "failed";
    response["message"] = "client disabled";
    String jsonString;
    serializeJson(response, jsonString);

    server.send(200, "application/json", jsonString);
    return;
  }

  String row1 = "";
  String row2 = "";

  // Fetch the parameters from the request
  if (server.hasArg("row1")) row1 = server.arg("row1");
  if (server.hasArg("row2")) row2 = server.arg("row2");

  // Refresh the LCD
  displayText(row1.c_str(), row2.c_str());

  // The json response
  StaticJsonDocument<200> response;
  response["status"] = "success";
  response["message"] = "";
  String jsonString;
  serializeJson(response, jsonString);

  server.send(200, "application/json", jsonString);
}

// The logic for the api-get path ("api/get")
void handleAPIget() {
  if (!server.hasArg("id")) return;
  if (!server.hasArg("apiKey")) return;

  APIclient client = APIclientList::clients_getByID(server.arg("id").toInt());

  if (client.id == -1)
  {
    // The json response
    StaticJsonDocument<200> response;
    response["status"] = "failed";
    response["message"] = "invalid client id";
    String jsonString;
    serializeJson(response, jsonString);

    server.send(200, "application/json", jsonString);
    return;
  }

  if ((String)client.apiKey != server.arg("apiKey"))
  {
    // The json response
    StaticJsonDocument<200> response;
    response["status"] = "failed";
    response["message"] = "invalid api key";
    String jsonString;
    serializeJson(response, jsonString);

    server.send(200, "application/json", jsonString);
    return;
  }

  if (!client.enabled)
  {
    // The json response
    StaticJsonDocument<200> response;
    response["status"] = "failed";
    response["message"] = "client disabled";
    String jsonString;
    serializeJson(response, jsonString);

    server.send(200, "application/json", jsonString);
    return;
  }


  StaticJsonDocument<200> response;
  response["row1"] = line1Text;
  response["row2"] = line2Text;
  String jsonString;
  serializeJson(response, jsonString);

  server.send(200, "application/json", jsonString);
}

void handlePrefsAPI() {
  if (server.hasArg("apiEnabled")) apiActivated = server.arg("apiEnabled") == "on";
  else apiActivated = false;

  // Persist the API setting
  putPrefs();

  server.sendHeader("Location", "/"); // Redirect to root
  showLoadingScreen(303, "Einstellungen werden Eingebaut"); // 303 See Other
}

// The logic for the set path ("/set?row1=[...]&row2=[...]")
void handleSet() {
  String row1 = "";
  String row2 = "";

  // Fetch the parameters from the request
  if (server.hasArg("Row1")) row1 = server.arg("Row1");
  if (server.hasArg("Row2")) row2 = server.arg("Row2");

  // Refresh the LCD
  displayText(row1.c_str(), row2.c_str());

  server.sendHeader("Location", "/"); // Redirect to root
  showLoadingScreen(303, "Anzeige wird aktualisiert");
}

// The logic for the preferences-apply-path ("preferences/apply?ssid=[...]&pwd=[...]")
void handlePrefsApply() {
  // Fetch data from the request
  if(server.hasArg("ssid")) ssid = server.arg("ssid");
  if(server.hasArg("password")) password = server.arg("password");

  putPrefs();

  showLoadingScreen(200, "Bitte wechsel das WLAN und verbinde dich neu mit dem Gerät");
  delay(2000);
  WiFi.disconnect();
  WiFi.begin(ssid.c_str(), password.c_str());
}

void setupWebServerRoutes() {
  // Webserver Routes
  server.on("/preferences/api", HTTP_POST, handlePrefsAPI);
  server.on("/", HTTP_GET, handleRoot);
  server.on("/preferences", HTTP_GET, handlePreferences);
  server.on("/preferences/apply", HTTP_POST, handlePrefsApply);
  server.on("/set", HTTP_GET, handleSet);
  server.on("/api/set", HTTP_GET, handleAPISet);
  server.on("/api/get", HTTP_GET, handleAPIget);
  server.on("/clear", HTTP_GET, handleClear);
  server.on("/api/clear", HTTP_GET, handleApiClear);
  
  server.begin();
}
#pragma endregion

#pragma region Logic
void setup() {
  Serial.begin(9600);
  pinMode(STOP_BUTTON, INPUT_PULLUP);
  pinMode(LED, OUTPUT);
  
  lcd.init();
  lcd.backlight();

  lcd.setCursor(0, 0);
  lcd.print("Starte");

  // Fetch the WiFi login-data
  fetchPrefs();

  // Connect to WiFi
  WiFi.mode(WIFI_STA);
  WiFi.begin(ssid.c_str(), password.c_str());
  uint8_t attempts = 0;
  while(WiFi.status() != WL_CONNECTED && attempts < 20) {
    delay(500);
    attempts++;
  }

  if(WiFi.status() == WL_CONNECTED) {
    displayTextTemp("Verbunden", WiFi.localIP().toString().c_str(), 3000);
  } else {
    // Hotspot fallback
    WiFi.mode(WIFI_AP);
    WiFi.softAP("BusStopESP");
    displayTextTemp("Hotspot aktiv:", WiFi.softAPIP().toString().c_str(), 3000);
  }

  setupWebServerRoutes();
}

void loop() {
  handleStopButton();
  handleDisplay();
  server.handleClient();
}
#pragma endregion